<a href="https://colab.research.google.com/github/gaveter/Project_cs/blob/master/Project.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

# Project 2019-20
1. Normalize the loan_lenders table. In the normalized table, each row must have one loan_id and one lender.
2. For each loan, add a column duration corresponding to the number of days between the disburse time and the planned expiration time.
3. Find the lenders that have funded at least twice.
4. For each country, compute how many loans have involved that country as borrowers.
5. For each country, compute the overall amount of money borrowed.
6. Like the previous point, but expressed as a percentage of the overall amount lent.
7. Like the three previous points, but split for each year (with respect to disburse time).
8. For each lender, compute the overall amount of money lent.
9. For each country, compute the difference between the overall amount of money lent and the overall amount of money borrowed.
10. Which country has the highest ratio between the difference computed at the previous point and the population?
11. Which country has the highest ratio between the difference computed at point 9 and the population that is not below the poverty line?
12. For each year, compute the total amount of loans. Each loan that has planned expiration time and disburse time in different years must 
have its amount distributed proportionally to the number of days in each year. For example, a loan with disburse time December 1st, 2016,
 planned expiration time January 30th 2018, and amount 5000USD has an amount of 5000USD * 31 / (31+365+30) = 363.85 for 2016, 5000USD * 365 / (31+365+30) = 4284.04
for 2017, and 5000USD * 30 / (31+365+30) = 352.11 for 2018.
Â© 2019 GitHub, Inc.

## Load libraries

In [0]:
import pandas as pd
from datetime import datetime
import re
import numpy as np

## Task1

### Load csv (loans_lenders)

In [5]:
loans_lender = pd.read_csv('/content/drive/My Drive/Foundation of computer science/additional-kiva-snapshot/loans_lenders.csv')
len(loans_lender)

1387432

In [6]:
loans_lender.head()

   loan_id                                            lenders
0   483693  muc888, sam4326, camaran3922, lachheb1865, reb...
1   483738  muc888, nora3555, williammanashi, barbara5610,...
2   485000  muc888, terrystl, richardandsusan8352, sherri4...
3   486087  muc888, james5068, rudi5955, daniel9859, don92...
4   534428  muc888, niki3008, teresa9174, mike4896, david7...

In [0]:
loans_lender["lenders"]=loans_lender["lenders"].str.split(', ') #creazione lista per ogni riga
loans_lender_norm=loans_lender.explode('lenders')

In [8]:
loans_lender_norm.head(10)

   loan_id        lenders
0   483693         muc888
0   483693        sam4326
0   483693    camaran3922
0   483693    lachheb1865
0   483693    rebecca3499
0   483693  karlheinz4543
0   483693        jerrydb
0   483693      paula8951
0   483693           gmct
0   483693       amra9383

### Result

In [9]:
loans_lender_norm=loans_lender_norm.reset_index(drop=True)
loans_lender_norm.head()

   loan_id      lenders
0   483693       muc888
1   483693      sam4326
2   483693  camaran3922
3   483693  lachheb1865
4   483693  rebecca3499

In [10]:
len(loans_lender_norm)

28293931

## Task2
- For each loan, add a column duration corresponding to the number of days between the disburse time and the planned expiration time

### Load csv (loans)

In [0]:
loan = pd.read_csv('/content/drive/My Drive/Foundation of computer science/additional-kiva-snapshot/loans.csv')

In [12]:
loan.head()

   loan_id       loan_name  ... repayment_interval distribution_model
0   657307            Aivy  ...          irregular      field_partner
1   657259  Idalia Marizza  ...            monthly      field_partner
2   658010           Aasia  ...            monthly      field_partner
3   659347         Gulmira  ...            monthly      field_partner
4   656933         Ricky\t  ...             bullet      field_partner

[5 rows x 31 columns]

### Check missing values

In [0]:
missing_loan = pd.isnull(loan[["planned_expiration_time"]])

In [14]:
loan.loc[64:69][["planned_expiration_time","disburse_time"]]

          planned_expiration_time                  disburse_time
64                            NaN  2010-11-18 08:00:00.000 +0000
65                            NaN  2010-11-25 08:00:00.000 +0000
66                            NaN  2010-11-25 08:00:00.000 +0000
67                            NaN  2010-11-16 08:00:00.000 +0000
68  2016-11-03 06:10:05.000 +0000  2016-09-07 07:00:00.000 +0000
69                            NaN  2010-11-10 08:00:00.000 +0000

In [15]:
type(loan.loc[67][["planned_expiration_time"]][0]), type(loan.loc[68][["planned_expiration_time"]][0])

(float, str)

### Conversion attribute 'planned_expiration_time', 'disburse_time' to string

In [0]:
loan["planned_expiration_time"] = loan.apply(lambda x: str(x["planned_expiration_time"]),axis=1) #each row (value is float)
loan["disburse_time"] = loan.apply(lambda x: str(x["disburse_time"]),axis=1)

In [17]:
loan.loc[68]["disburse_time"]

'2016-09-07 07:00:00.000 +0000'

In [0]:
def difference_dates(date1,date2):
  if (date1=="nan" or date2=="nan"):
    return(np.nan) #float
  date1 = date1[:-10] #delete part +0000
  date1 = datetime.strptime(date1,"%Y-%m-%d %H:%M:%S")
  date2 = date2[:-10]
  date2 = datetime.strptime(date2,"%Y-%m-%d %H:%M:%S")
  diff = (date1 - date2).days
  return(diff)

In [0]:
loan["duration"] = loan.apply(lambda x: difference_dates(x["planned_expiration_time"],x["disburse_time"]),axis=1)

In [20]:
zeroDuration = loan[loan["duration"]==0][["planned_expiration_time","disburse_time","duration"]]
len(zeroDuration)

772

### Result

In [21]:
loan.head()[["planned_expiration_time","disburse_time","duration"]]

         planned_expiration_time                  disburse_time  duration
0  2014-02-14 03:30:06.000 +0000  2013-12-22 08:00:00.000 +0000      53.0
1  2014-03-26 22:25:07.000 +0000  2013-12-20 08:00:00.000 +0000      96.0
2  2014-02-15 21:10:05.000 +0000  2014-01-09 08:00:00.000 +0000      37.0
3  2014-02-21 03:10:02.000 +0000  2014-01-17 08:00:00.000 +0000      34.0
4  2014-02-13 06:10:02.000 +0000  2013-12-17 08:00:00.000 +0000      57.0

## Task 3
- Find the lenders that have funded at least twice

In [22]:
loan['status'].unique()

array(['funded', 'expired', 'refunded', 'fundRaising'], dtype=object)

In [0]:
fundedLoan=loan[['loan_id','status']]

### Inner-join between loan_lender and type loan 'funded'

In [24]:
lenders_funded = pd.merge(loans_lender_norm,fundedLoan,how="inner",on="loan_id")
lenders_funded.head()

   loan_id      lenders  status
0   483693       muc888  funded
1   483693      sam4326  funded
2   483693  camaran3922  funded
3   483693  lachheb1865  funded
4   483693  rebecca3499  funded

In [0]:
numberfunded_lenders = lenders_funded.groupby('lenders')['loan_id'].count().reset_index(level=0)
numberfunded_lenders.columns=['lenders','count']

In [0]:
numberfunded_lenders = numberfunded_lenders[numberfunded_lenders['count']>=2]
numberfunded_lenders = numberfunded_lenders.sort_values('count',ascending=False)

### Result

In [27]:
numberfunded_lenders.head()

                  lenders   count
462833          gooddogg1  177645
1324411     trolltech4460  150762
462243               gmct  128159
1008585               nms  104314
1290437  themissionbeltco   81434

## Task 4
- For each country, compute how many loans have involved that country as borrowers.

In [28]:
loan[["country_name","funded_amount","loan_amount","num_lenders_total"]]

        country_name  funded_amount  loan_amount  num_lenders_total
0        Philippines          125.0        125.0                  3
1           Honduras          400.0        400.0                 11
2           Pakistan          400.0        400.0                 16
3         Kyrgyzstan          625.0        625.0                 21
4        Philippines          425.0        425.0                 15
...              ...            ...          ...                ...
1419602        Kenya          400.0        400.0                 16
1419603  Philippines          300.0        300.0                 12
1419604        Ghana         2425.0       2425.0                 76
1419605  Philippines          100.0        100.0                  3
1419606   Madagascar          175.0        175.0                  7

[1419607 rows x 4 columns]

In [29]:
loan['status'].unique()

array(['funded', 'expired', 'refunded', 'fundRaising'], dtype=object)

In [0]:
funded=loan[loan['status']=='funded'][['loan_id','country_name','status','currency','funded_amount','loan_amount','num_lenders_total']].head(2)
expired=loan[loan['status']=='expired'][['loan_id','country_name','status','funded_amount','loan_amount','num_lenders_total']].head(2)
refunded=loan[loan['status']=='refunded'][['loan_id','country_name','status','funded_amount','loan_amount','num_lenders_total']].head(2)
fundRaising=loan[loan['status']=='fundRaising'][['loan_id','country_name','status','funded_amount','loan_amount','num_lenders_total']].head(2)

In [31]:
esempio = pd.concat([funded,expired,refunded,fundRaising],axis=0)

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

In [32]:
esempio

      country_name currency  ...  num_lenders_total       status
0      Philippines      PHP  ...                  3       funded
1         Honduras      HNL  ...                 11       funded
22     Philippines      NaN  ...                  4      expired
25     Philippines      NaN  ...                  6      expired
361          Kenya      NaN  ...                  0     refunded
1420        Mexico      NaN  ...                 67     refunded
5067         Ghana      NaN  ...                  0  fundRaising
16167      Lebanon      NaN  ...                 53  fundRaising

[8 rows x 7 columns]

In [30]:
loan["status"].unique()

array(['funded', 'expired', 'refunded', 'fundRaising'], dtype=object)

### Check missing values

In [33]:
missing = pd.isnull(loan[['country_name']])
missing[missing['country_name']==True]

Empty DataFrame
Columns: [country_name]
Index: []

In [0]:
country_numberLoan = loan.groupby('country_name')['status'].count()
country_numberLoan = country_numberLoan.sort_values(ascending=False)

### Result

In [36]:
country_numberLoan.head()

country_name
Philippines    285336
Kenya          143699
Peru            86000
Cambodia        79701
El Salvador     64037
Name: status, dtype: int64

## Task 5
- For each country, compute the overall amount of money borrowed.

In [0]:
country_amountLoan = loan.groupby('country_name')['funded_amount'].sum()

In [0]:
country_amountLoan = country_amountLoan.sort_values(ascending=False)

### Result

In [39]:
country_amountLoan.head()

country_name
Philippines    97045925.0
Peru           78702800.0
Kenya          63650255.0
Paraguay       53715200.0
Cambodia       50829425.0
Name: funded_amount, dtype: float64

## Task 6
- Like the previous point, but expressed as a percentage of the overall amount lent.

In [0]:
country_amountLoan_perc=pd.DataFrame(country_amountLoan).reset_index(level=0)
country_amountLoan_perc.columns=['country','total']

In [41]:
total_lent=country_amountLoan_perc['total'].sum()
total_lent

1130185170.0

In [0]:
country_amountLoan_perc['percentage']=round(country_amountLoan_perc['total']/total_lent*100,2)

### Result

In [43]:
country_amountLoan_perc.head()

       country       total  percentage
0  Philippines  97045925.0        8.59
1         Peru  78702800.0        6.96
2        Kenya  63650255.0        5.63
3     Paraguay  53715200.0        4.75
4     Cambodia  50829425.0        4.50

## Task 7
- Like the three previous points, but split for each year (with respect to disburse time).

In [0]:
loanYear = loan[['country_name','disburse_time','funded_amount','loan_amount']]

In [87]:
missing = pd.isnull(loanYear[['disburse_time']])
missing[missing['disburse_time']==True]

Empty DataFrame
Columns: [disburse_time]
Index: []

In [98]:
len(loanYear[loanYear['disburse_time']=="nan"])

2813

In [0]:
loanYear = loanYear[loanYear['disburse_time']!='nan']

In [154]:
inizio=datetime.now()
print("Inizio: "+inizio.strftime("%H:%M:%S"))
loanYear['year']=loanYear.apply(lambda x: int(x["disburse_time"].split('-')[0]),axis=1)
fine=datetime.now()
print("Fine: "+fine.strftime("%H:%M:%S"))
diff= fine - inizio
diff

Inizio: 21:25:51
Fine: 21:26:13

datetime.timedelta(0, 22, 72467)

In [157]:
loanYear.groupby(['country_name','year'])['funded_amount'].sum()

country_name  year
Afghanistan   2007     194975.0
              2008     365375.0
              2009     581825.0
              2010     563350.0
              2011     245125.0
                        ...
Zimbabwe      2013     678525.0
              2014    1307975.0
              2015     723150.0
              2016     787550.0
              2017    1214125.0
Name: funded_amount, Length: 748, dtype: float64